<!DOCTYPE html>
<html lang="en">
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8">
		
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>AP CSP Create Task, Page 1</title>
	</head>

	<body>
        <h2>Usando un proceso de desarrollo para organizar tu c&oacute;digo</h2>
        <div class="learn">
            <p><strong>En la pr&aacute;ctica Tarea de creaci&oacute;n,</strong> te familiarizar&aacute;s con las gu&iacute;as y el vocabulario de la AP Tarea de creaci&oacute;n, y practicar&aacute;s la realizaci&oacute;n de la tarea con la gu&iacute;a y la retroalimentaci&oacute;n de tu profesor.</p>
            <p><strong>En esta p&aacute;gina,</strong> reflexionar&aacute;s sobre tus h&aacute;bitos de programaci&oacute;n y planear&aacute;s el proceso de desarrollo que usar&aacute;s para la Tarea de creaci&oacute;n.</p>
        </div>
        
        <p>Tarea de creaci&oacute;n es para que presentes algo al consejo universitario, para incluirlo en tu puntuaci&oacute;n del AP CSP que sea creativo: un programa que dise&ntilde;es (con o sin un compa&ntilde;ero), un video del programa ejecut&aacute;ndose (desarrollado por ti mismo), y una respuesta escrita sobre tu programa y tu proceso de desarrollo (escrito por ti mismo).</p>
        
        <div class="comment">CRD-2.E.1, CRD-2.E.2</div>
        <p>
            El proceso que utilices para desarrollar tu programa puede ser organizado y estrat&eacute;gico o puede ser un proceso de exploraci&oacute;n. Hay diferentes maneras de programar. Aqu&iacute; hay algunas fases comunes por las que pasa un programador:
            </p>
<ul>
                <div class="comment">CRD-2.F.1</div>
                <li>investigando y reflexionando&mdash;averiguando los requisitos: lo que el usuario quiere que haga el programa</li>
                <li>dise&ntilde;ando&mdash;la planificaci&oacute;n de c&oacute;mo ser&aacute; la aplicaci&oacute;n para el usuario y el enfoque general que se utilizar&aacute; para programarla</li>
                <li>prototipos&mdash;construyendo un borrador del programa</li>
                <li>Prob&aacute;ndolo&mdash;probarlo, compartirlo con otros para obtener retroalimentaci&oacute;n, arreglar cualquier error, y hacer cualquier mejora necesaria</li>
            </ul>
        <p></p>    
    
        <div class="comment">CRD-2.E.3, CRD-2.E.4</div>
        <p>Tu proceso de desarrollo podr&iacute;a ser <em>iterativo</em> (que implica varios ciclos de desarrollo y luego pruebas y retroalimentaci&oacute;n) y/o puede sr <em>incremental</em> (lo que significa que se construyen y prueban piezas m&aacute;s peque&ntilde;as del proyecto antes de combinarlas).</p>
        <div class="forYouToDo">
            <ol>
				<li>Piensa en c&oacute;mo programas &iquest;Sueles programar de forma iterativa (programando y luego probando y luego volviendo a programar, etc.)? &iquest;Sueles programar de forma incremental (construyendo y perfeccionando una pieza a la vez? <!--What do you tend to think about before you start programming? Do you think about what the app will do and what features it will have or do you just start coding? Do you think about how you might program certain parts (such as "I'll need a <code>repeat</code> block for that")?--> &iquest;Hay alg&uacute;n problema de desarrollo con el que se hayas encontrado una y otra vez?&nbsp; &iquest;Hay alguna forma en que pueda cambiar tu proceso de desarrollo para evitar esos desaf&iacute;os?</li>
                <div class="comment"><br></div>
<div class="comment">CRD-2.E: Desarrollar un programa usando un proceso de desarrollo.</div>		
				<li>Antes de comenzar tu Tarea de creaci&oacute;n, decide qu&eacute; tipo de proceso de desarrollo usar&aacute;s. Escribe tu plan. Est&aacute; bien si cambias el plan a medida que avanzas, pero mant&eacute;n un registro de tus cambios tambi&eacute;n para que puedas escribir sobre ellos para la respuesta escrita que tendr&aacute;s que presentar.</li>
			</ol>
		</div>


	

</body></html>