<!DOCTYPE html>
<html lang="en">
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8">
		
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>AP CSP Create Task, Page 2</title>
	</head>

	<body>
        <h2>Escogiendo tu proyecto</h2>
        <div class="learn">
            <p><strong>En esta p&aacute;gina,</strong> leer&aacute;s las instrucciones para la creaci&oacute;n de la tarea y decidir&aacute;s sobre un proyecto que te ayudar&aacute; a cumplirlas.</p>
        </div>
        
        <div class="takeNote"><strong>Lo m&aacute;s importante que puedes hacer para obtener una alta puntuaci&oacute;n en la Tarea de creaci&oacute;n es seguir <em>exactamente</em> </strong><strong>las instrucciones del Consejo Universitario</strong>. Tu profesor puede darte cr&eacute;dito por una idea especialmente creativa, trabajando muy bien con tu compa&ntilde;ero, pasando horas extras en tu proyecto, haciendo un video muy brillante, o escribiendo un trabajo m&aacute;s largo o mejor escrito;pero para que el proceso de calificaci&oacute;n sea lo m&aacute;s justo posible para los estudiantes de todo el pa&iacute;s, los calificadores del Consejo Universitario no le dar&aacute;n cr&eacute;dito por nada de eso. <strong><em>Solo</em> calificar&aacute;n tu trabajo seg&uacute;n la r&uacute;brica, y si no sigues la r&uacute;brica con&nbsp; <em>precisi&oacute;n</em>, perder&aacute;s puntos.</strong> Esta pr&aacute;ctica Tarea de creaci&oacute;n es una oportunidad para que intentes cumplir con los est&aacute;ndares y luego discutas lo bien que lo has logrado con tu profesor y tus compa&ntilde;eros. (En la Tarea de creaci&oacute;n oficial, no podr&aacute;s hablar con tu profesor o tus compa&ntilde;eros sobre tu trabajo.)</div>
        <div class="forYouToDo">
			<ol>
				<li>Antes de que decidas qu&eacute; tipo de proyecto quieres construir, lee las directrices de AP CSP para la Tarea de creaci&oacute;n. Necesitar&aacute;s planear un proyecto que demuestre todas las cosas que los calificadores buscar&aacute;n (entrada/salida, uso de una lista, etc.)</li>
				<li><img class="imageRight" src="/bjc-r/img/icons/talk-with-your-partner.png" alt="Talk with Your Partner" title="Talk with Your Partner">&iquest;Qu&eacute; tipo de proyecto les parecer&iacute;a interesante para programar?&iquest;Es razonable la cantidad de tiempo que tienes? (Recuerda que en la Tarea de Creaci&oacute;n obtienes puntos por seguir la r&uacute;brica, no por hacer algo lujoso o complejo.) &iquest;Es realista para los conocimientos de programaci&oacute;n que tienes ahora mismo? Y lo m&aacute;s importante, &iquest;te permitir&aacute; demostrar todo lo que requieren las directrices de la Tarea de creaci&oacute;n?</li>
				<li><img class="inline" src="/bjc-r/img/icons/write-out-thoughts.png" alt="Write Out Your Thoughts" title="Write Out Your Thoughts">Una vez que te hayas decidido por un proyecto, lleva la cuenta de <em>c&oacute;mo</em> decidiste. &iquest;Qu&eacute; ten&iacute;as en mente al decidirlo? &iquest;Qu&eacute; ideas descartaste y por qu&eacute;? &iquest;A qui&eacute;n consultaste sobre tus ideas y qu&eacute; te dijeron? &iquest;Qu&eacute; te hizo elegir el proyecto que hiciste?</li>
			</ol>
		</div>
    

	

</body></html>