<!DOCTYPE html>
<html lang="en">
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8">
		
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>AP CSP Create Task, Page 3</title>
	</head>

	<body>
        <h2>Implementando tu proceso de desarrollo</h2>
        <div class="learn">
            <p><strong>En esta p&aacute;gina,</strong> planificar&aacute;s tu proyecto Tarea de creaci&oacute;n (informalmente y luego formalmente),y luego lo programar&aacute;s.</p>
        </div>
        
        <div class="forYouToDo">
			<ol>
                <div class="comment">CRD-2.F.2</div>
				<li>Investiga y reflexiona: 
                    
<ol>
                        <li>&iquest;Cu&aacute;les son las limitaciones de su programa? (&iquest;Qu&eacute; caracter&iacute;sticas debe tener? &iquest;Cu&aacute;les son las limitaciones con las que trabajar&aacute;?) </li>
                        <div class="todo">CRD-2.F.3 ("Recopilando informaci&oacute;n")</div>
                        <li>Re&uacute;ne informaci&oacute;n de las personas que podr&iacute;an usar tu programa. &iquest;Cu&aacute;les son sus necesidades e intereses? Puedes recolectar datos mediante encuestas, entrevistas o pruebas de usuario de programas similares o versiones previas, o viendo a la gente usar aplicaciones similares.</li>
                        <li>Lleva la cuenta de lo que aprendes.</li>
                    </ol>
                </li>
                <div class="vocabBig">
                    <div class="todo">CRD-2.B.4, CRD-2.F.4, CRD-2.F.5</div>
                    <ul>
                        <li>Las <strong>especificaciones</strong> describen los requisitos de un programa, incluyendo su funcionamiento y posiblemente una descripci&oacute;n de las interacciones del usuario.</li>
                        <li>El <strong>comportamiento</strong> de un programa es c&oacute;mo debe funcionar, a menudo incluyendo lo que el usuario ver&aacute; y c&oacute;mo interactuar&aacute; con el programa..</li>
                    </ul>
                </div> 
				<div class="todo">CRD-2.F ("Dise&ntilde;a tu proyecto.")</div>
                <li>Dise&ntilde;a tu proyecto. 
                    
<ol>
                        <li>Escribe las <em>especificaciones</em> de tu programa describiendo su <em>comportamiento</em>.</li>
                        <div class="todo">CRD-2.F.6, CRD-2.F.7 ("Piensa en c&oacute;mo")</div>
                        <li>Piensa en c&oacute;mo cumplir&aacute;s estas especificaciones. Podr&iacute;as crear un gui&oacute;n gr&aacute;fico de lo que suceder&aacute; o diagramar lo que el usuario ver&aacute;. &iquest;Qu&eacute; abstracciones podr&iacute;an ayudarte a desarrollar el c&oacute;digo? &iquest;Qu&eacute; partes programar&aacute;s primero? &iquest;Qu&eacute; partes tendr&aacute;n que ser construidas despu&eacute;s de que otras sean terminadas? &iquest;C&oacute;mo probar&aacute;s cada parte y el proyecto completo? Desarrollar&aacute;s tu proyecto de forma iterativa? &iquest;Lo desarrollar&aacute;s de forma incremental?</li>
                    </ol>
                </li>
			</ol>
		</div>
    
        <div class="comment">CRD-2.H.1, CRD-2.H.2 ("The College Board is very particular")</div>
        <div class="examFullWidth">
			<div class="todo">Brian, you made this an "exam" box, and I have no problem with that characterization, in theory, but this isn't about the "exam;" it's about the "create task," and I don't want to confuse people. --MF, 9/2/19<br>
			Orange boxes are for important computer science ideas.  This isn't important, isn't computer science, and isn't an idea.  The create task is part of the exam! -bh</div>
		El Consejo de la Universidad es muy particular en cuanto a reconocer el contenido que no desarrollaste t&uacute; mismo. Probablemente est&eacute;s familiarizado con el uso de comillas alrededor de textos que no escribiste y con la creaci&oacute;n de una bibliograf&iacute;a, pero para la Tarea de creaci&oacute;n, tambi&eacute;n necesitas reconocer el&nbsp; <em>c&oacute;digo</em> ue otras personas escribieron o incluso te ayudaron a escribir. Este reconocimiento debe incluir d&oacute;nde conseguiste el c&oacute;digo o qui&eacute;n lo escribi&oacute;, y debe ser incluido en la documentaci&oacute;n de tu programa.</div>
        <div class="forYouToDo">
			<ol start="3">
				<div class="comment">CRD-2.H ("Desarrolla un prototipo")</div>
                <li>Desarrolla un prototipo que cumpla con tus especificaciones. Al igual que t&uacute;, mant&eacute;n un registro de cualquier pieza de c&oacute;digo que haya sido escrita por alguien m&aacute;s (ya sea usando los comentarios de Snap<em>!</em> o en otro documento).</li>
			</ol>
		</div>


	

</body></html>