<!DOCTYPE html>
<html lang="en">
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8">
		
		<script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
		<title>AP CSP Create Task, Page 6</title>
	</head>

	<body>
        <h2>Evaluando tu trabajo</h2>
		<div class="todo">TG: Hand out the rubric.</div>
        <div class="learn">
            <p><strong>En esta p&aacute;gina,</strong> utilizar&aacute;s la r&uacute;brica para evaluar tu programa, video y respuesta escrita, y har&aacute;s los ajustes necesarios.</p>
        </div>
        
        <p>Cuando est&aacute;s trabajando en la pr&aacute;ctica de Tarea de creaci&oacute;n, aprovecha que puedes hablar con tu profesor y tus compa&ntilde;eros de clase. En la tarea de creaci&oacute;n oficial, no podr&aacute;s pedirle ayuda a tu profesor, y tu compa&ntilde;ero s&oacute;lo podr&aacute; ayudarte con la parte de programaci&oacute;n.</p>
        <div class="forYouToDo">
			<ol>
				<li>Cuando termines con tu programa, video y respuesta escrita, da un paso atr&aacute;s y comp&aacute;ralo cuidadosamente con la r&uacute;brica de calificaci&oacute;n. No esperes que te den puntos por algo; s&eacute; implacable: &iquest;Est&aacute;s <em>definitivamente</em> seguro de que obtendr&aacute;s cr&eacute;dito por <em>cada</em> una de las partes? Haz los cambios necesarios en cualquier parte de tu trabajo hasta que est&eacute;s seguro de que obtendr&aacute;s todo el cr&eacute;dito.</li>
                <li>Si est&aacute;s en la pr&aacute;ctica de Tarea de creaci&oacute;n, p&iacute;dele a un compa&ntilde;ero de clase o a tu profesor que revise tu trabajo y que te ayude a considerar lo que a&uacute;n podr&iacute;as necesitar hacer de forma diferente para recibir el cr&eacute;dito completo. si alguien te pide que revises su tarea de pr&aacute;ctica, s&eacute; implacable; no le haces un favor a tu amigo si no le se&ntilde;alas un problema porque no quieres herir sus sentimientos. Puedes ser tanto sincero como amable.</li>
				<li>&iexcl;Celebra cuando termines! Tomar un curso AP requiere mucho esfuerzo. &iexcl;Haz algo especial para recompensarte por lo duro que has trabajado!</li>
			</ol>
		</div>


	

</body></html>