<!DOCTYPE html>
<html lang="en">
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
        
        <script type="text/javascript" src="/bjc-r/llab/loader.js"></script>
        <title>Unit 8 Lab 1: Recursive Reporters, Page 1</title>
        <link href="/bjc-r/advancednote.css" rel="stylesheet" type="text/css">
    </head>

    <body>
    <div class="todo">ST-4/4/18 Here are some comments/questions/feedback to consider from Tim Matthies Piazza <a href="https://piazza.com/class/h8yx482idav52y?cid=2025" target="_blank">Post1</a> <a href="https://piazza.com/class/h8yx482idav52y?cid=2024" target="_blank">Post2</a></div>
        <h2>Contando &aacute;rboles</h2>
        <div class="todo">They may have already been built recursive reporters (see new optional projects in U1: Modeling Language, U2: Making Computers Do Math, and U3: More Math Tools) , so it seems weird to suddenly re-introduce them at this point in the course. WHY HERE? WHY NOW? --MF, 9/26/18</div>
        <div class="todo">
            <p>PG: Generic editing: Beta doesn't have a consistent name. Sometimes Betty, sometimes Betsy. General comment: I don't feel like we've settled on a goal and really crafted a sequence to reach it. I think we're showing off all sorts of things that can be done with recursion, rather than thinking about how to /teach/ recursion and structuring this so that the student really becomes the master. This page: I basically like this, but I feel it is less focused on helping a kid write a recursive reporter than on the mathematics.  Alphie's solution and the first four lines of the TOL are clever but, for our purposes, irrelevant. Worse, if we want to build a power of 2 block, we should teach how to do /that/ recursively. The method here (last two lines of TOL) does, sort of, do that, but because the focus is elsewhere (and we never draw it back), it is likely to be special purpose. We don't see the right abstraction, Alphie's "one less than a power of 2." </p>
            <p>MF: Need to adjust for changes throughout curriculum</p>
        </div>
        

		<img class="imageRight" src="/bjc-r/img/7-recursion/tree-level9.jpg" alt="picture of fractal tree" title="picture of fractal tree">
		<p>En unidad 7, construiste <a href="/bjc-r/cur/programming/7-recursion/1-trees/1-recursive-tree.html?topic=nyc_bjc%2F6-recursion-trees-fractals.topic&amp;course=bjc4nyc.html&amp;novideo&amp;noassignment" title="Recursive Tree">&aacute;rboles recursivos</a>. Cada &aacute;rbol est&aacute; formado por segmentos de l&iacute;nea.</p>
        <div class="forYouToDo" id="first">
            <ol>
                <li>Abre tu proyecto "U7L1-arbol". &iquest;Cu&aacute;ntos segmentos de l&iacute;nea hay en un &aacute;rbol de cada nivel? Completa esta tabla. (Puedes contar por t&iacute; mismoo hacer que Snap<em>!</em> cuente por ti.)</li>
                <table class="center bordered" summary="table showing the number of line segments in a TREE of a given level">
                    <tbody>
<tr>
                        <th scope="col" style="font-weight:normal;"><var>nivel</var></th>
                        <th scope="col" style="font-weight: normal; white-space: nowrap;"><var style="">conteo de segmentos<br></var></th>
                    </tr>
                    <tr>
                        <td>1</td>
                        <td>1</td>
                    </tr>
                    <tr>
                        <td>2</td>
                        <td>3</td>
                    </tr>
                    <tr>
                        <td>3</td>
                        <td>&nbsp;</td>
                    </tr>
                    <tr>
                        <td>4</td>
                        <td>&nbsp;</td>
                    </tr>
                    <tr>
                        <td>5</td>
                        <td>&nbsp;</td>
                    </tr>
                    <tr>
                        <td>6</td>
                        <td>&nbsp;</td>
                    </tr>
                </tbody></table>
                <li>&iquest;C&oacute;mo se compara el n&uacute;mero de segmentos de un nivel con el n&uacute;mero de segmentos del nivel anterior?</li>
                <li>Construye un bloque cuya entrada sea un n&uacute;mero de &aacute;rbol y cuya salida sea el n&uacute;mero de segmentos en ese nivel:</li>
                <img class="indent" src="/bjc-r/img/8-recursive-reporters/treecounter.png" alt="segments in tree (7) reporting 127" title="segments in tree (7) reporting 127"><br>
            </ol>
        </div>
                
        <div class="dialogue">
            <div class="stagedir">Alphie y Betty discuten sobre el c&oacute;digo que crearon.</div>
<!--            <div class="comment">I worry that "one less than a power of 2" will need some review. Some of these kids have not had algebra, right? And even if they <em>all</em> have, some of the kids I saw were not strong mathematically. --MF  Keeping as is; powers of 2 are discussed in Unit 7 and are a sixth-grade Common Core topic.</div> -->
            <div><span>Alphie:</span> I noticed a pattern in the table. Each number of segments is one less than a power of 2.</div>
            <div><span>Betty:</span> &iquest;C&oacute;mo se ve tu c&oacute;digo?</div>
            <div><span>Alphie:</span> Utilic&eacute; un bucle <code>para</code> a fin de construir la potencia de 2, luego rest&eacute; 1 al final:</div>
            <div class="comment">Image should be redone with plain prototype labels. --MF, 9/26/18</div>
            <div class="stagedir"><img src="/bjc-r/img/8-recursive-reporters/alphiecode.png" alt="segments in tree(n){script variables(answer); set(answer) to (1); for (i=1 to n){set(answer) to (answer*2)} report(answer-1)}" title="segments in tree(n){script variables(answer); set(answer) to (1); for (i=1 to n){set(answer) to (answer*2)} report(answer-1)}"></div>
            <div><span>Alphie:</span> Al final, el bloque de <code>informe</code> env&iacute;a el valor final. Puse la &uacute;ltima operaci&oacute;n matem&aacute;tica all&iacute;.</div>
            <div><span>Betty:</span> Vaya. &iexcl;El m&iacute;o se ve muy diferente! Hice que el c&oacute;digo se pareciera al c&oacute;digo del <span style="font-family: monospace;">&aacute;rbol</span><code></code>.</div>
            <div><span>Alphie:</span> Interesante... pero no lo entiendo.</div>
            <div><span>Betty:</span> Mira el c&oacute;digo del <code>&aacute;rbol</code>. Usamos la <em>recursi&oacute;n</em>. Construimos un segmento, girado, llamamos a <code>&aacute;rbol</code> para construir un &aacute;rbol m&aacute;s peque&ntilde;o, girado de nuevo, y luego llamamos a <code>&aacute;rbol</code> de nuevo para construir otro &aacute;rbol m&aacute;s peque&ntilde;o.</div>
            <div><span>Alphie:</span>&nbsp; &iexcl;Genial! Podemos pensar en c&oacute;mo funciona ese algoritmo para escribir los <code>segmentos en el &aacute;rbol</code> reportero de forma recursiva. Pero podemos ignorar todas las partes m&oacute;viles y giratorias, &iquest;verdad? D&eacute;jame intentarlo. </div>
            <div><span>Betty:</span> &iexcl;De acuerdo! Y no lo olvides: <em>&iexcl;los casos base son importantes!</em></div>
        </div>
        
        <p>Has construido y trabajado con bloques de <em>mando</em> recursivos. La recursi&oacute;n tmbi&eacute;n puede ser utilizada en los <em>reporteros</em>.</p>
        
        <div class="forYouToDo">
            <ol start="4">
                <li>
                    Si a&uacute;n no lo has hecho, construye un <strong>reportero recursivo&nbsp; </strong>que informe el n&uacute;mero de segmentos en un &aacute;rbol de nivel <var>n</var>. 
					
<div class="endnote">Recuerda que tienes que pulsar "Aplicar" antes de poder usar tu bloque de forma recursiva en el Editor de Bloques.</div>
                </li>
            </ol>
        </div>
    
	

</body></html>